///////////////////////////////////////////////////////////
////////////// Календарь /////////////////////////////////
/////////////////////////////////////////////////////////
$("#data").datepicker({
    monthNames: ['Январь', 'Февраль', 'Март', 'Апрель',
        'Май', 'Июнь', 'Июль', 'Август', 'Сентябрь',
        'Октябрь', 'Ноябрь', 'Декабрь'
    ],
    dayNamesMin: ['Вс', 'Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб'],
    firstDay: 1,
    dateFormat: "DD, d MM, yy"
});
///////////////////////////////////////////////////////////
////////////// По умолчанию диалоговое окно скрыто ///////
/////////////////////////////////////////////////////////
$('#dialog').dialog({
    autoOpen: false
});
///////////////////////////////////////////////////////////
////////////// Кнопка запуска проверки ///////////////////
/////////////////////////////////////////////////////////
function btnClick() {
    var validation = {
        name: /^[а-яёА-ЯЁ]{2,}$/,
        phone: /^[+][7][(]\d{3}[)]\d{3}[-]\d{4}$/,
        email: /^[a-zA-Z]{2,}\S?[a-zA-Z]{2,}[@][a-z]{2,}[.][a-zA-Z]{2,}$/
    };
    valid(validation.name, document.form.name.value, '#name');
    valid(validation.phone, document.form.phone.value, '#phone');
    valid(validation.email, document.form.email.value, '#email');
}
///////////////////////////////////////////////////////////
////////////// Функция валидации инпутов /////////////////
/////////////////////////////////////////////////////////
function valid(items, item, identifier) {
    if (items.test(item)) {
        $(identifier).css({ borderColor: 'blue' });
        $('#dialog').text('Спасибо, данные получены').dialog("open");
    } else {
        $(identifier).effect("bounce", "slow").css({ borderColor: 'red' });
        if (item === "") {
            $('#dialog').text('Пустое значение').dialog("open");
        } else {
            $('#dialog').text('Не верный формат').dialog("open");
        }
    }
}